HarryVienna/ESP32-Weather-Station-and-Air-Quality-Monitor/BaseStation/sdkconfig.defaults
# --- Target ---
CONFIG_IDF_TARGET="esp32p4"

# --- Chip Revision (ESP32-P4 rev <3.0 and >=3.0 are mutually exclusive) ---
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# No reboot after panic
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# --- Flash ---
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# --- Partition Table ---
CONFIG_PARTITION_TABLE_CUSTOM=y

# --- Compiler ---
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# --- PSRAM ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# --- Cache (optimized for display performance) ---
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# --- FreeRTOS ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000

# --- Experimental features (required for ESP32-P4 MIPI DSI) ---
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# --- Wi-Fi (ESP32-P4 has no native radio: routed to the on-board ESP32-C6 ---
# --- co-processor over ESP-Hosted/SDIO via esp_wifi_remote) ---
CONFIG_ESP_HOST_WIFI_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y

# --- LVGL Configuration ---
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_DEF_REFR_PERIOD=15
# Disabled: combined with LV_USE_SNAPSHOT this overflows IRAM
# CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM is not set
CONFIG_LV_USE_SNAPSHOT=y

# Fonts for LVGL
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_48=y